
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЭлементовФормы();

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовФормы();

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	ЭтоПосещениеАттракционов = Объект.ВидНоменклатуры = Перечисления.ВидНоменклатуры.ПосещениеАттракциона;
	
	Элементы.ВидАттракциона.Видимость = ЭтоПосещениеАттракционов;
	Элементы.КоличествоПосещений.Видимость = ЭтоПосещениеАттракционов;	
	
КонецПроцедуры

#КонецОбласти
